# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap 'neovim/neovim'
tap "yqrashawn/goku"

# tap 'homebrew/bundle'

# Binaries
# brew 'svn'
brew 'ack'
brew 'bat'
brew 'gcc'
brew 'pkg-config'
brew 'awscli'
brew 'coreutils'
brew 'gh'
brew 'git'
brew 'hub'
brew 'mas'
brew 'trash'
brew 'tree'
brew 'tldr'
brew 'tig'
brew 'httpie'
brew 'curl'
brew 'wget'
brew 'neovim'
brew 'docker'
brew 'z'
brew 'yarn'
brew 'fzf'
brew 'htop'
brew 'jq'
brew 'ncdu'
brew 'archey'
brew 'mackup'
brew 'thefuck'
brew "yqrashawn/goku/goku"

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'apparency'
cask 'quicklookase'
cask 'qlvideo'
cask 'mdimagesizemdimporter'

# Fonts
cask 'font-inconsolata'
cask 'font-fira-code'
cask 'font-roboto'
cask 'font-jetbrains-mono'
cask 'font-ibm-plex'
cask 'font-hack-nerd-font'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-source-code-pro'
cask 'font-hack'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-anonymice-powerline'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-mono-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-liberation-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-monofur-for-powerline'
cask 'font-noto-mono-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-ubuntu-mono-derivative-powerline'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'notion'
cask 'slack'
cask 'visual-studio-code'
cask 'karabiner-elements'
cask 'bartender'



# Mac App Store
mas "1Password", id: 443987910
mas 'Evernote', id: 406056744 
mas 'Moom', id: 419330170
mas 'Skitch', id: 425955336
mas 'Amphetamine', id: 937984704
mas 'DragonDrop', id: 499148234
mas 'ToothFairy', id: 1191449274
mas 'Bear', id: 1091189122
mas 'Spark', id: 1176895641
mas 'Dash', id: 458034879
